In [1]:
import pandas as pd
import numpy as np
import os

## File Guest

In [38]:
df_guest = pd.read_excel("guests.xlsx", index_col=0)

In [7]:
df_guest.head()

   Unnamed: 0    guest  discount
0           0  guest_1      0.09
1           1  guest_2      0.00
2           2  guest_3      0.07
3           3  guest_4      0.00
4           4  guest_5      0.10

In [8]:
df_guest.tail()

      Unnamed: 0       guest  discount
3995        3995  guest_3996      0.00
3996        3996  guest_3997      0.15
3997        3997  guest_3998      0.07
3998        3998  guest_3999      0.08
3999        3999  guest_4000      0.07

In [10]:
# Guest duplicati
df_guest.guest.duplicated().any()

False

In [12]:
# Range discount
df_guest.discount.min(), df_guest.discount.max()

(0.0, 0.19)

In [14]:
# Check nan
df_guest.isna().any()

Unnamed: 0    False
guest         False
discount      False
dtype: bool

In [28]:
# Check Type
df_guest.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4000 non-null   int64
 1   guest       4000 non-null   object
 2   discount    4000 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 93.9+ KB

## File Hotels

In [43]:
df_hotel = pd.read_excel('hotels.xlsx', index_col=0)

In [44]:
df_hotel.head()

     hotel  rooms  price
0  hotel_1     13    273
1  hotel_2     18     92
2  hotel_3     12    141
3  hotel_4     18    157
4  hotel_5      7    298

In [45]:
df_hotel.tail()

         hotel  rooms  price
395  hotel_396      5    212
396  hotel_397     12     68
397  hotel_398     14    102
398  hotel_399     16    284
399  hotel_400     14    145

In [18]:
# Guest duplicati
df_hotel.hotel.duplicated().any()

False

In [23]:
# Range rooms
df_hotel.rooms.min(), df_hotel.rooms.max()

(5, 19)

In [24]:
# Range price
df_hotel.price.min(), df_hotel.price.max()

(50, 299)

In [25]:
# Check nan
df_hotel.isna().any()

Unnamed: 0    False
hotel         False
rooms         False
price         False
dtype: bool

In [27]:
# Check Type
df_hotel.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  400 non-null    int64
 1   hotel       400 non-null    object
 2   rooms       400 non-null    int64
 3   price       400 non-null    int64
dtypes: int64(3), object(1)
memory usage: 12.6+ KB

## Preferences

In [36]:
df_pref = pd.read_excel("preferences.xlsx", index_col=0)

In [37]:
df_pref.head()

     guest      hotel  priority
0  guest_1  hotel_168         1
1  guest_1  hotel_207         2
2  guest_1  hotel_222         3
3  guest_1  hotel_124         4
4  guest_1  hotel_223         5

In [31]:
df_pref.tail()

       Unnamed: 0       guest      hotel  priority
99528       99528  guest_4000  hotel_123        28
99529       99529  guest_4000  hotel_396        29
99530       99530  guest_4000  hotel_161        30
99531       99531  guest_4000  hotel_330        31
99532       99532  guest_4000  hotel_290        32

In [32]:
# Range price
df_pref.priority.min(), df_pref.priority.max()

(1, 49)

In [33]:
# Check nan
df_pref.isna().any()

Unnamed: 0    False
guest         False
hotel         False
priority      False
dtype: bool

In [34]:
# Check Type
df_pref.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99533 entries, 0 to 99532
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  99533 non-null  int64
 1   guest       99533 non-null  object
 2   hotel       99533 non-null  object
 3   priority    99533 non-null  int64
dtypes: int64(2), object(2)
memory usage: 3.0+ MB

## Export in CSV

In [40]:
df_guest.to_csv("guests.csv", index=False)
df_hotel.to_csv("hotels.csv", index=False)
df_pref.to_csv("preferences.csv", index=False)